[
    {
      "title": "ChatGPT4o-based Multi-Agent System for Single-Cell Data Analysis",
      "year": "2024",
      "image": "https://dsc106.com/labs/lab02/images/empty.svg",
      "description": "Developed a multi-agent system using ChatGPT4o to streamline single-cell data analysis for biologists. Integrated UI with Python and Node.js to automate workflows and designed experiments to evaluate the robustness and reproducibility of machine learning algorithms."
    },
    {
      "title": "Single-Cell Annotation Methods with scGPT and Tangram",
      "year": "2024",
      "image": "https://dsc106.com/labs/lab02/images/empty.svg",
      "description": "Developed novel single-cell annotation methods using scGPT (a BERT-based NLP model) and Tangram (deep learning framework). Enhanced cross-modal data integration for transcriptomic and proteomic matrices and optimized data preprocessing pipelines using Python and SLURM."
    },
    {
      "title": "Interactive Academic Planning Tool with ChatGPT4o",
      "year": "2024",
      "image": "https://dsc106.com/labs/lab02/images/empty.svg",
      "description": "Co-developed an interactive academic planning tool leveraging ChatGPT4o. Customized recommendations for students using GPT architecture and integrated Python for backend services to improve information accessibility across UCSD departments."
    },
    {
      "title": "Tumor Microenvironment Analysis with mRNA-seq Data",
      "year": "2023",
      "image": "https://dsc106.com/labs/lab02/images/empty.svg",
      "description": "Designed workflows for tumor microenvironment analysis using mRNA-seq raw data. Leveraged deep learning models to process and analyze large-scale transcriptomic data and applied the LASSO algorithm for quality control and cancer-related gene identification."
    },
    {
      "title": "GPS Bus Tracking System with Real-Time Data Visualization",
      "year": "2023",
      "image": "https://dsc106.com/labs/lab02/images/empty.svg",
      "description": "Co-developed a GPS bus tracking system with real-time data visualization. Built algorithms to process location data for public transit optimization using C++ and CMake, and collaborated across teams to refine hardware-software integration."
    },
    {
      "title": "Machine Learning Models for Cancer Feature Analysis",
      "year": "2022",
      "image": "https://dsc106.com/labs/lab02/images/empty.svg",
      "description": "Engineered machine learning models to analyze relationships between cancer features and clinical outcomes. Implemented hierarchical clustering and GAU for survival predictions and advanced Python and R pipelines with integrated programming."
    },
    {
      "title": "Predictive Modeling for Sales Data",
      "year": "2024",
      "image": "https://dsc106.com/labs/lab02/images/empty.svg",
      "description": "Developed a predictive model using Python and scikit-learn to forecast sales trends for a retail company."
    },
    {
      "title": "Reinforcement Learning for Game AI",
      "year": "2023",
      "image": "https://dsc106.com/labs/lab02/images/empty.svg",
      "description": "Implemented a reinforcement learning algorithm to train an AI agent to play a simple game."
    },
    {
      "title": "Data Visualization Dashboard",
      "year": "2023",
      "image": "https://dsc106.com/labs/lab02/images/empty.svg",
      "description": "Created an interactive dashboard using Tableau to visualize key business metrics."
    },
    {
      "title": "scRNA-seq Analysis Tool",
      "year": "2022",
      "image": "https://dsc106.com/labs/lab02/images/empty.svg",
      "description": "Built a tool in R to analyze single-cell RNA sequencing data for a research project."
    },
    {
      "title": "E-commerce Website Development",
      "year": "2022",
      "image": "https://dsc106.com/labs/lab02/images/empty.svg",
      "description": "Designed and developed a fully functional e-commerce website using HTML, CSS, and JavaScript."
    },
    {
      "title": "AI-Powered Chatbot",
      "year": "2021",
      "image": "https://dsc106.com/labs/lab02/images/empty.svg",
      "description": "Developed a chatbot using natural language processing (NLP) techniques to assist customers."
    }
  ]